
# 11.2.1 問題(1) ------------------------------------------------------------

# (1.1)
x <- c(290, 50, 80, 100, 200, 350, 430, 80, 210, 110, 70, 260, 220, 330, 170, 420, 80, 300, 290, 230)
y <- c(350, 70, 100, 130, 250, 430, 520, 100, 260, 140, 90, 320, 270, 400, 210, 510, 100, 370, 350, 280)

par(mfrow=c(2, 1))
hist(x, breaks=c(0, 60, 120, 180, 240, 300, 360, 420, 480, 540, 600))
hist(y, breaks=c(0, 60, 120, 180, 240, 300, 360, 420, 480, 540, 600))

mean(x)
median(x)

mean(y)
median(y)

varp <- function(x){
  標本分散 <- var(x) * ((length(x) -1)/length(x))
  標本分散
}

print(varp(x))
print(varp(y))

print(sqrt(varp(x)))
print(sqrt(varp(y)))

# (1.2)
差得点 <- x - y
par(mfrow=c(1, 1))
hist(差得点)
mean(差得点)
median(差得点)
varp(差得点)
sqrt(varp(差得点))

# (1.3)
cor(x, y)

# (1.4)

単回帰結果 <- lm(y~x)
summary(単回帰結果)

plot(x, y)
abline(単回帰結果)

