
# 3.2 散布図 -----------------------------------------------------------------

統計テスト1 <- c(6, 10, 6, 10, 5, 3, 5, 9, 3, 3, 11, 6, 11, 9, 7, 5, 8, 7, 7, 9)
統計テスト2 <- c(10, 13, 8, 15, 8, 6, 9, 10, 7, 3, 18, 14, 18, 11, 12, 5, 7, 12, 7, 7)

plot(統計テスト1, 統計テスト2)

plot(心理学テスト, 統計テスト1)

plot(心理学テスト, 統計テスト2)


# 3.3 共分散 -----------------------------------------------------------------

共分散1と2 <- sum((統計テスト1 - mean(統計テスト1))*(統計テスト2 - mean(統計テスト2)))/length(統計テスト1)
print(共分散1と2)

共分散1と2 <- mean((統計テスト1 - mean(統計テスト1))*(統計テスト2 - mean(統計テスト2)))
print(共分散1と2)

不偏共分散 <- cov(統計テスト1, 統計テスト2)*(length(統計テスト1) -1) / length(統計テスト1)
print(不偏共分散)


身長m <- c(1.5, 1.6, 1.7, 1.8, 1.9)
身長cm <- 身長m * 100

体重 <- c(50, 70, 60, 80, 90)

print(cov(身長m, 体重))
print(cov(身長cm, 体重))


# 3.4 相関係数 ----------------------------------------------------------------

cov(統計テスト1, 統計テスト2)/(sd(統計テスト1)*sd(統計テスト2))
cor(統計テスト1, 統計テスト2)

cor(心理学テスト, 統計テスト1)
cor(心理学テスト, 統計テスト2)


# 3.5 クロス集計表 --------------------------------------------------------------

数学 <- c("嫌い", "嫌い", "好き", "好き", "嫌い", "嫌い", "嫌い", "嫌い", "嫌い", "好き", 
          "好き", "嫌い", "好き", "嫌い", "嫌い", "好き", "嫌い", "嫌い", "嫌い", "嫌い")

table(数学)

統計 <- c("好き", "好き", "好き", "好き", "嫌い", "嫌い", "嫌い", "嫌い", "嫌い", "嫌い", 
          "好き", "好き", "好き", "嫌い", "好き", "嫌い", "嫌い", "嫌い", "嫌い", "嫌い")

table(統計)

table(数学, 統計)


# 3.6 ファイ係数 ---------------------------------------------------------------

数学イチゼロ <- ifelse(数学=="好き", 1, 0)
print(数学イチゼロ)

統計イチゼロ <- ifelse(統計=="好き", 1, 0)

cor(数学イチゼロ, 統計イチゼロ)


# 練習問題 --------------------------------------------------------------------

(1)
practice_time <- c(1, 3, 10, 12, 6, 3, 8, 4, 1, 5)
routine_exam_score <- c(20, 40, 100, 80, 50, 50, 70, 50, 10, 60)
plot(practice_time, routine_exam_score)

(2)
manual_cov <- mean((practice_time - mean(practice_time))*(routine_exam_score - mean(routine_exam_score)))
manual_sd_p_t <- sqrt(mean((practice_time - mean(practice_time))^2))
manual_sd_r_e_s <- sqrt(mean((routine_exam_score - mean(routine_exam_score))^2))

manual_cor <- manual_cov / (manual_sd_p_t * manual_sd_r_e_s)
print(manual_cor)

cor(practice_time, routine_exam_score)

(3)
weston_or_japanese <- c("洋食", "和食", "和食", "洋食", "和食", "洋食", "洋食", "和食", "洋食", "洋食", 
                        "和食", "洋食", "和食", "洋食", "和食", "和食", "洋食", "洋食", "和食", "和食")

sweet_or_hot <- c("甘党", "辛党", "甘党", "甘党", "辛党", "辛党", "辛党", "辛党", "甘党", "甘党",
                  "甘党", "甘党", "辛党", "辛党", "甘党", "辛党", "辛党", "甘党", "辛党", "辛党")

table(weston_or_japanese, sweet_or_hot)

b_w_o_j <- ifelse(weston_or_japanese=="洋食", 1, 0)
b_w_o_h <- ifelse(sweet_or_hot=="甘党", 1, 0)

cor(b_w_o_j, b_w_o_h)
