set.seed(9999)
n <- 200
因子負荷行列 <- matrix(c(0.09884, 0.17545, 0.52720, 0.73462, 0.45620, 0.72141, 0.47258, 0.17901, 0.07984, 0.37204), nrow=5)
独自性 <- diag(sqrt(c(0.530201, 0.254119, 0.309986, 0.546036, 0.346539)))
因子得点 <- matrix(rnorm(2*n), nrow=2)
独自因子 <- matrix(rnorm(5*n), nrow=5)
五教科 <- round(t(因子負荷行列%*%因子得点 +独自性%*%独自因子)*10+50)
colnames(五教科) <- c("国語", "社会", "数学", "理科", "英語")

print(五教科)



# 16.2 Rで分析してみよう ----------------------------------------------------------

相関行列 <- cor(五教科)

print(相関行列)

五教科因子分析 <- factanal(五教科, factors=2)

print(五教科因子分析)

共通性 <- 1-五教科因子分析$uniquenesses
print(共通性)

print(五教科因子分析, cutoff=0)

五教科因子分析斜交 <- factanal(五教科, factors=2, rotation="promax")
print(五教科因子分析斜交, cutoff=0)

五教科因子分析回転なし <- factanal(五教科, factors=2, rotation="none") 
print(五教科因子分析回転なし)

初期解をもとにプロマックス回転 <- promax(loadings(五教科因子分析回転なし), m=4)
print(初期解をもとにプロマックス回転)

因子間相関 <- solve(t(初期解をもとにプロマックス回転$rotmat) %*% 初期解をもとにプロマックス回転$rotmat)