# 4.3.1 点推定の手順 ------------------------------------------------------------

身長 <- c(165.2, 175.9, 161.7, 174.2, 172.1, 163.3, 170.9, 170.6, 168.4, 171.3)
mean(身長)


# 4.3.2 推定量と推定値 -----------------------------------------------------------

var(身長)


# 4.4.3 確率分布 --------------------------------------------------------------

サイコロ6 <- ceiling(runif(n=6, min=0, max=6))
table(サイコロ6)

サイコロ600万 <- ceiling(runif(n=6000000, min=0, max=6))
table(サイコロ600万)


# 4.4.4 母集団分布 -------------------------------------------------------------

barplot(c(2/3, 1/3), names.arg=c("男性", "女性"))


# 4.4.5 正規分布 --------------------------------------------------------------

curve(dnorm(x, mean=0, sd=1), from=-4, to=4)
curve(dnorm(x, mean=1, sd=1), add=TRUE)
curve(dnorm(x, mean=0, sd=2), add=TRUE)


# 4.4.7 正規分布から単純無作為抽出を行う --------------------------------------------------

標本 <- rnorm(n=5, mean=50, sd=10)
print(標本)
hist(標本)

大標本 <- rnorm(n=10000, mean=50, sd=10)
hist(大標本)


# 4.5.3 正規母集団の母平均の推定 ------------------------------------------------------

標本 <- rnorm(n=10,mean=50, sd=10)
print(mean(標本))


# 4.5.4 標本分布を求める ----------------------------------------------------------

標本平均 <- numeric(length=10000) #推定値を格納する場所を予約
print(標本平均)

for(i in 1:10000){
  標本 <- rnorm(n=10, mean=50, sd=10)
  標本平均[i] <- mean(標本)
}

hist(標本平均)

誤差絶対値5以下 <- ifelse(abs(標本平均-50)<= 5, 1, 0)
table(誤差絶対値5以下)

mean(標本平均)
var(標本平均)

hist(標本平均, freq=FALSE)
curve(dnorm(x, mean=50, sd=sqrt(10)), add=TRUE)



# 4.5.6 標準誤差 --------------------------------------------------------------

標本平均 <- numeric(length=10000)

for(i in 1:10000){
  標本 <- rnorm(n=100, mean=50, sd=10)
  標本平均[i] <- mean(標本)
}

var(標本平均)

hist(標本平均)


# 4.6.1 標本分散と不偏分散の標本分布 ----------------------------------------------------

標本分散 <- numeric(length=10000)
不偏分散 <- numeric(length=10000)

for(i in 1:10000){
  標本 <- rnorm(n=10, mean=50, sd=10)
  
  標本分散[i] <- mean((標本 - mean(標本))^2)
  不偏分散[i] <- var(標本)
}

mean(標本分散)
mean(不偏分散)

sd(標本分散)
sd(不偏分散)

hist(標本分散, breaks=seq(0, 500, 10))
hist(不偏分散, breaks=seq(0, 500, 10))

標本分散誤差100以上 <- ifelse(標本分散>200, 1, 0)
不偏分散誤差100以上 <- ifelse(不偏分散>200, 1, 0)

table(標本分散誤差100以上)
table(不偏分散誤差100以上)


mean(sqrt(不偏分散))


# 4.6.2 中央値の標本分布 ----------------------------------------------------------

標本平均 <- numeric(length=10000)
標本中央値 <- numeric(length=10000)

for(i in 1:10000){
  標本 <- rnorm(n=10, mean=50, sd=10)
  
  標本平均[i] <- mean(標本)
  標本中央値[i] <- median(標本)
}

mean(標本平均)
mean(標本中央値)

sd(標本平均)
sd(標本中央値)



# 練習問題 --------------------------------------------------------------------

#(1)
sample_dist <- numeric(length=5000)

for(i in 1:5000){
  sample <- rnorm(n=20, mean=50, sd=10)
  sample_dist[i] <- mean(sample)
}

hist(sample_dist, freq=FALSE)
curve(dnorm(x, mean=50, sd=sqrt(100/20)), add=TRUE)

#(2)

curve(dnorm(x, sd=sqrt(1/25)), -3, 3)
curve(dnorm(x, sd=sqrt(1/16)), -3, 3, add=TRUE)
curve(dnorm(x, sd=sqrt(1/9)), -3, 3, add=TRUE)
curve(dnorm(x, sd=sqrt(1/4)), -3, 3, add=TRUE)
curve(dnorm(x, sd=sqrt(1/1)), -3, 3, add=TRUE)
